Documents/ИзменениеМестаПозицииШтатногоРасписанияВСтруктуреПредприятия.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>ИзменениеМестаПозицииШтатногоРасписанияВСтруктуреПредприятия</Name>
			<BasedOn>
				<xr:Item>Document.ИзменениеШтатногоРасписания</xr:Item>
				<xr:Item>Document.УтверждениеШтатногоРасписания</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ИсторияИзмененияМестаПозицииШтатногоРасписанияВСтруктуреПредприятия</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Руководитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДолжностьРуководителя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОснованиеПодписиРуководителя</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОснованиеПодписи</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.УтверждениеШтатногоРасписания</v8:Type>
						<v8:Type>cfg:DocumentRef.ИзменениеШтатногоРасписания</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗапрета</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Позиции</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Позиция</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ШтатноеРасписание</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МестоВСтруктуреПредприятия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаВступленияВСилу</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ИзменениеМестаПозицииШтатногоРасписанияВСтруктуреПредприятия/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступом.ЗаполнитьНаборыЗначенийДоступа.
Процедура ЗаполнитьНаборыЗначенийДоступа(Таблица) Экспорт
	
	УправлениеШтатнымРасписанием.ЗаполнитьНаборыЗначенийДоступа(ЭтотОбъект, Таблица, Ложь);
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		
		МетаданныеОбъекта = Метаданные();
		
		Для Каждого ПараметрЗаполнения Из ДанныеЗаполнения Цикл
			
			Если МетаданныеОбъекта.Реквизиты.Найти(ПараметрЗаполнения.Ключ)<>Неопределено Тогда
				ЭтотОбъект[ПараметрЗаполнения.Ключ] = ПараметрЗаполнения.Значение;
			Иначе
				Если ОбщегоНазначения.ЭтоСтандартныйРеквизит(МетаданныеОбъекта.СтандартныеРеквизиты, ПараметрЗаполнения.Ключ) Тогда
					ЭтотОбъект[ПараметрЗаполнения.Ключ] = ПараметрЗаполнения.Значение;
				КонецЕсли;
			КонецЕсли;
			
		КонецЦикла;
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ИзменениеШтатногоРасписания") Тогда
		ЗаполнитьПоДокументуИзмененияШтатногоРасписания(ДанныеЗаполнения, "ДатаВступленияВСилу");
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.УтверждениеШтатногоРасписания") Тогда
		ЗаполнитьПоДокументуИзмененияШтатногоРасписания(ДанныеЗаполнения, "МесяцВступленияВСилу");
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	ПроведениеСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);

	ДанныеДляПроведения = ДанныеДляПроведения();

	МестаПозицийШтатногоРасписанияВСтруктуреПредприятия.СформироватьДвиженияИсторииИзмененияМестаПозицииШтатногоРасписанияВСтруктуреПредприятия(
		Движения, ДанныеДляПроведения.ИсторияИзмененияМестаПозицииШтатногоРасписанияВСтруктуреПредприятия);

КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)

	РезультатПроверки = МестаПозицийШтатногоРасписанияВСтруктуреПредприятия.ПроверитьВозможностьВнесенияИзменений(
		Позиции);

	Если Не РезультатПроверки.ИзмененияВозможны Тогда

		Для Каждого РезультатПроверкиПозиции Из РезультатПроверки.Позиции Цикл

			Отбор = Новый Структура("Позиция, ДатаВступленияВСилу", РезультатПроверкиПозиции.Позиция,
				РезультатПроверкиПозиции.Дата);
			СтрокиПозиции = Позиции.НайтиСтроки(Отбор);

			Для Каждого СтрокаПозиции Из СтрокиПозиции Цикл

				ТекстСообщения = НСтр(
					"ru = 'Дата последнего изменения штатного расписания больше даты, с которой вступит в силу этот документ.'");

				ТекстСообщения = ТекстСообщения + Символы.ПС + СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru='См. %1, позиция - ""%2""'"), РезультатПроверкиПозиции.РегистраторПредставление,
					РезультатПроверкиПозиции.Позиция);

				ПутьКРеквизиту = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти(
					"Позиции", СтрокаПозиции.НомерСтроки, "Позиция");
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, Ссылка, ПутьКРеквизиту, "Объект", Отказ);

			КонецЦикла;

		КонецЦикла;

		Возврат;

	КонецЕсли;

	ПроверитьДублиКлючевыхЗначений(Отказ);
	ПроверитьПересечениеПериодовПозицийШтатногоРасписания(Отказ);

КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)

	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;

	Документы.ИзменениеМестаПозицииШтатногоРасписанияВСтруктуреПредприятия.ЗаполнитьДатуЗапретаРедактирования(ЭтотОбъект);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьПоДокументуИзмененияШтатногоРасписания(ДанныеЗаполнения, ИмяРеквизитаДатаВступленияВСилу);

	ДокументОснование = ДанныеЗаполнения;
		
	ДатаВступленияВСилу = Дата(1, 1, 1);
	Если ЗначениеЗаполнено(ДокументОснование) Тогда
		
		ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументОснование,
			СтрШаблон("Организация, Подразделение, %1", ИмяРеквизитаДатаВступленияВСилу));

		Организация = ЗначенияРеквизитов.Организация;
		Подразделение = ЗначенияРеквизитов.Подразделение;
		ДатаВступленияВСилу = ЗначенияРеквизитов[ИмяРеквизитаДатаВступленияВСилу];

	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Позиции.Позиция КАК Позиция,
	|	Позиции.МестоВСтруктуреПредприятия КАК МестоВСтруктуреПредприятия
	|ИЗ
	|	&ИмяТаблицы.Позиции КАК Позиции
	|ГДЕ
	|	Позиции.Ссылка = &ДокументОснование";

	Запрос.УстановитьПараметр("ДокументОснование", ДокументОснование);

	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ИмяТаблицы", ОбщегоНазначения.ИмяТаблицыПоСсылке(ДокументОснование));

	Позиции.Очистить();

	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();

	Пока Выборка.Следующий() Цикл
		СтрокаПозиции = Позиции.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаПозиции, Выборка);
		СтрокаПозиции.ДатаВступленияВСилу = ДатаВступленияВСилу;
	КонецЦикла;

КонецПроцедуры

Функция ДанныеДляПроведения()

	ДанныеДляПроведения = Новый Структура;

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);

	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПозицииШтатногоРасписания.Позиция КАК ПозицияШтатногоРасписания,
	|	ПозицииШтатногоРасписания.МестоВСтруктуреПредприятия КАК МестоВСтруктуреПредприятия,
	|	ПозицииШтатногоРасписания.ДатаВступленияВСилу КАК Период
	|ИЗ
	|	Документ.ИзменениеМестаПозицииШтатногоРасписанияВСтруктуреПредприятия КАК
	|		ИзменениеМестаПозицииШтатногоРасписанияВСтруктуреПредприятия
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ИзменениеМестаПозицииШтатногоРасписанияВСтруктуреПредприятия.Позиции КАК
	|			ПозицииШтатногоРасписания
	|		ПО ИзменениеМестаПозицииШтатногоРасписанияВСтруктуреПредприятия.Ссылка = ПозицииШтатногоРасписания.Ссылка
	|ГДЕ
	|	ИзменениеМестаПозицииШтатногоРасписанияВСтруктуреПредприятия.Ссылка = &Ссылка";

	ИзмененияМестПозицийШтатногоРасписания = Запрос.Выполнить().Выгрузить();
	ДанныеДляПроведения.Вставить("ИсторияИзмененияМестаПозицииШтатногоРасписанияВСтруктуреПредприятия",
		ИзмененияМестПозицийШтатногоРасписания);

	Возврат ДанныеДляПроведения;

КонецФункции

Процедура ПроверитьДублиКлючевыхЗначений(Отказ)

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаПозиций.НомерСтроки КАК НомерСтроки,
	|	ТаблицаПозиций.Позиция КАК Позиция,
	|	ТаблицаПозиций.ДатаВступленияВСилу КАК ДатаВступленияВСилу
	|ПОМЕСТИТЬ ВТПозицииДокумента
	|ИЗ
	|	&ТаблицаПозиций КАК ТаблицаПозиций
	|ГДЕ
	|	ТаблицаПозиций.Позиция <> ЗНАЧЕНИЕ(Справочник.ШтатноеРасписание.ПустаяСсылка)
	|	И ТаблицаПозиций.ДатаВступленияВСилу <> ДАТАВРЕМЯ(1, 1, 1)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Позиции.Позиция КАК Позиция,
	|	Позиции.ДатаВступленияВСилу КАК ДатаВступленияВСилу
	|ПОМЕСТИТЬ ВТДублирующиесяЗначения
	|ИЗ
	|	ВТПозицииДокумента КАК Позиции
	|СГРУППИРОВАТЬ ПО
	|	Позиции.Позиция,
	|	Позиции.ДатаВступленияВСилу
	|ИМЕЮЩИЕ
	|	КОЛИЧЕСТВО(Позиции.НомерСтроки) > 1
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Позиции.НомерСтроки КАК НомерСтроки
	|ИЗ
	|	ВТПозицииДокумента КАК Позиции
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТДублирующиесяЗначения КАК ДублирующиесяЗначения
	|		ПО Позиции.Позиция = ДублирующиесяЗначения.Позиция
	|		И Позиции.ДатаВступленияВСилу = ДублирующиесяЗначения.ДатаВступленияВСилу
	|СГРУППИРОВАТЬ ПО
	|	Позиции.Позиция,
	|	Позиции.ДатаВступленияВСилу,
	|	Позиции.НомерСтроки
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";

	Запрос.УстановитьПараметр("ТаблицаПозиций", Позиции);

	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();

	Пока Выборка.Следующий() Цикл
		
		ТекстСообщения = НСтр("ru='У данной строки повторяется позиция и дата вступления в силу с другой строкой.'");
		ПутьКРеквизиту = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("Позиции", Выборка.НомерСтроки, "Позиция");

		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, Ссылка, ПутьКРеквизиту, "Объект", Отказ);

	КонецЦикла;

КонецПроцедуры

Процедура ПроверитьПересечениеПериодовПозицийШтатногоРасписания(Отказ)

	МассивПозиций = ОбщегоНазначения.ВыгрузитьКолонку(Позиции, "Позиция", Истина);
	ОбщегоНазначенияКлиентСервер.УдалитьВсеВхожденияЗначенияИзМассива(МассивПозиций, ПредопределенноеЗначение(
		"Справочник.ШтатноеРасписание.ПустаяСсылка"));

	ДанныеПозиций = УправлениеШтатнымРасписанием.ДанныеПозицийШтатногоРасписания(Истина, МассивПозиций,
		ТекущаяДатаСеанса(), Ложь);

	Для Каждого СтрокаПозиции Из Позиции Цикл

		ДанныеПозиции = ДанныеПозиций.Получить(СтрокаПозиции.Позиция);
		Если ДанныеПозиции <> Неопределено 
			И ЗначениеЗаполнено(СтрокаПозиции.ДатаВступленияВСилу)
			И ДанныеПозиции.ДатаУтверждения > СтрокаПозиции.ДатаВступленияВСилу Тогда

			ТекстСообщения = НСтр(
				"ru='Дата вступления в силу не может быть меньше даты утверждения позиции штатного расписания.'");
			ПутьКРеквизиту = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти(
					"Позиции", СтрокаПозиции.НомерСтроки, "Позиция");

			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, Ссылка, ПутьКРеквизиту, "Объект", Отказ);

		КонецЕсли;

	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#КонецЕсли
